ГаджетОн_Курс_ЕДТ_11092020/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НаборПрав</name>
    <attributes>
      <name>ИмяРоли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СинонимРоли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Активна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ГаджетОн_Курс_ЕДТ_11092020/src/Catalogs/Пользователи/ObjectModule.bsl
// Описание
// 
// Параметры:
// 	ПользовательБазы - ПользовательИнформационнойБазы - 
Процедура ЗаполнитьНаборПрав(ПользовательБазы) Экспорт
	
	РолиИБ = Метаданные.Роли;
	
	ЭтотОбъект.НаборПрав.Очистить();
	Для Каждого Роль Из РолиИБ Цикл
		
		СтрокаНабораПрав = ЭтотОбъект.НаборПрав.Добавить();
		
		СтрокаНабораПрав.ИмяРоли	 = Роль.Имя;
		СтрокаНабораПрав.СинонимРоли = Роль.Синоним;
		СтрокаНабораПрав.Активна	 = ПользовательБазы.Роли.Содержит(Роль);
		 
	КонецЦикла;
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	ПользовательБазы = ПользователиИнформационнойБазы.НайтиПоИмени(ЭтотОбъект.Наименование);
	
	Если ПользовательБазы = Неопределено Тогда
		ПользовательБазы = ПользователиИнформационнойБазы.СоздатьПользователя();
		ПользовательБазы.Имя 		= ЭтотОбъект.Наименование;
		ПользовательБазы.ПолноеИмя	= ЭтотОбъект.ПолноеИмя;
	КонецЕсли;
	
	ПользовательБазы.Роли.Очистить();
	НаборПравПользователя = ЭтотОбъект.НаборПрав.НайтиСтроки( Новый Структура("Активна", Истина) );
	
	Для Каждого СтрокаРолиПользователя Из НаборПравПользователя Цикл
		ТекущаяРоль = Метаданные.Роли.Найти(СтрокаРолиПользователя.ИмяРоли);
		ПользовательБазы.Роли.Добавить(ТекущаяРоль);
	КонецЦикла;
	
	ПользовательБазы.Записать();
	
КонецПроцедуры
